{"format": "graph-model", "generatedBy": "2.8.0", "convertedBy": "TensorFlow.js Converter v3.15.0", "signature": {"inputs": {"input_1": {"name": "input_1:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "224"}, {"size": "224"}, {"size": "3"}]}}}, "outputs": {"predictions": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "1000"}]}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/vgg16/block1_conv1/Conv2D/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "3"}, {"size": "64"}]}}}}}, {"name": "StatefulPartitionedCall/vgg16/block1_conv1/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}}}, {"name": "StatefulPartitionedCall/vgg16/block1_conv2/Conv2D/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/vgg16/block1_conv2/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/vgg16/block2_conv1/Conv2D/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/vgg16/block2_conv1/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/vgg16/block2_conv2/Conv2D/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/vgg16/block2_conv2/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/vgg16/block3_conv1/Conv2D/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/vgg16/block3_conv1/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/vgg16/block3_conv2/Conv2D/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "256"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/vgg16/block3_conv2/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}}}, {"name": "StatefulPartitionedCall/vgg16/block3_conv3/Conv2D/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "256"}, {"size": "256"}]}}}}}, {"name": "StatefulPartitionedCall/vgg16/block3_conv3/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/vgg16/block4_conv1/Conv2D/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "256"}, {"size": "512"}]}}}}}, {"name": "StatefulPartitionedCall/vgg16/block4_conv1/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}}}, {"name": "StatefulPartitionedCall/vgg16/block4_conv2/Conv2D/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "512"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/vgg16/block4_conv2/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/vgg16/block4_conv3/Conv2D/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "512"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/vgg16/block4_conv3/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}}}, {"name": "StatefulPartitionedCall/vgg16/block5_conv1/Conv2D/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "512"}, {"size": "512"}]}}}}}, {"name": "StatefulPartitionedCall/vgg16/block5_conv1/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/vgg16/block5_conv2/Conv2D/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "512"}, {"size": "512"}]}}}}}, {"name": "StatefulPartitionedCall/vgg16/block5_conv2/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}}}, {"name": "StatefulPartitionedCall/vgg16/block5_conv3/Conv2D/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "512"}, {"size": "512"}]}}}}}, {"name": "StatefulPartitionedCall/vgg16/block5_conv3/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}}}, {"name": "StatefulPartitionedCall/vgg16/flatten/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/vgg16/fc1/MatMul/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "25088"}, {"size": "4096"}]}}}}}, {"name": "StatefulPartitionedCall/vgg16/fc1/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4096"}]}}}}}, {"name": "StatefulPartitionedCall/vgg16/fc2/MatMul/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4096"}, {"size": "4096"}]}}}}}, {"name": "StatefulPartitionedCall/vgg16/fc2/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4096"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/vgg16/predictions/MatMul/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4096"}, {"size": "1000"}]}}}}}, {"name": "StatefulPartitionedCall/vgg16/predictions/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1000"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "input_1", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {"dim": [{"size": "-1"}, {"size": "224"}, {"size": "224"}, {"size": "3"}]}}}}, {"name": "StatefulPartitionedCall/vgg16/block1_conv1/Relu", "op": "_FusedConv2D", "input": ["input_1", "StatefulPartitionedCall/vgg16/block1_conv1/Conv2D/ReadVariableOp", "StatefulPartitionedCall/vgg16/block1_conv1/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"padding": {"s": "U0FNRQ=="}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "num_args": {"i": "1"}, "explicit_paddings": {"list": {}}, "epsilon": {"f": 0.0}}}, {"name": "StatefulPartitionedCall/vgg16/block1_conv2/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/vgg16/block1_conv1/Relu", "StatefulPartitionedCall/vgg16/block1_conv2/Conv2D/ReadVariableOp", "StatefulPartitionedCall/vgg16/block1_conv2/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "padding": {"s": "U0FNRQ=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "epsilon": {"f": 0.0}, "num_args": {"i": "1"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}}}, {"name": "StatefulPartitionedCall/vgg16/block1_pool/MaxPool", "op": "MaxPool", "input": ["StatefulPartitionedCall/vgg16/block1_conv2/Relu"], "attr": {"strides": {"list": {"i": ["1", "2", "2", "1"]}}, "padding": {"s": "VkFMSUQ="}, "data_format": {"s": "TkhXQw=="}, "ksize": {"list": {"i": ["1", "2", "2", "1"]}}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}}}, {"name": "StatefulPartitionedCall/vgg16/block2_conv1/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/vgg16/block1_pool/MaxPool", "StatefulPartitionedCall/vgg16/block2_conv1/Conv2D/ReadVariableOp", "StatefulPartitionedCall/vgg16/block2_conv1/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"num_args": {"i": "1"}, "T": {"type": "DT_FLOAT"}, "epsilon": {"f": 0.0}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "data_format": {"s": "TkhXQw=="}, "padding": {"s": "U0FNRQ=="}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}}}, {"name": "StatefulPartitionedCall/vgg16/block2_conv2/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/vgg16/block2_conv1/Relu", "StatefulPartitionedCall/vgg16/block2_conv2/Conv2D/ReadVariableOp", "StatefulPartitionedCall/vgg16/block2_conv2/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"use_cudnn_on_gpu": {"b": true}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "epsilon": {"f": 0.0}, "data_format": {"s": "TkhXQw=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "padding": {"s": "U0FNRQ=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "num_args": {"i": "1"}}}, {"name": "StatefulPartitionedCall/vgg16/block2_pool/MaxPool", "op": "MaxPool", "input": ["StatefulPartitionedCall/vgg16/block2_conv2/Relu"], "attr": {"data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "padding": {"s": "VkFMSUQ="}, "ksize": {"list": {"i": ["1", "2", "2", "1"]}}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}}}, {"name": "StatefulPartitionedCall/vgg16/block3_conv1/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/vgg16/block2_pool/MaxPool", "StatefulPartitionedCall/vgg16/block3_conv1/Conv2D/ReadVariableOp", "StatefulPartitionedCall/vgg16/block3_conv1/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "num_args": {"i": "1"}, "explicit_paddings": {"list": {}}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}}}, {"name": "StatefulPartitionedCall/vgg16/block3_conv2/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/vgg16/block3_conv1/Relu", "StatefulPartitionedCall/vgg16/block3_conv2/Conv2D/ReadVariableOp", "StatefulPartitionedCall/vgg16/block3_conv2/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "epsilon": {"f": 0.0}, "data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "padding": {"s": "U0FNRQ=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "num_args": {"i": "1"}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}}}, {"name": "StatefulPartitionedCall/vgg16/block3_conv3/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/vgg16/block3_conv2/Relu", "StatefulPartitionedCall/vgg16/block3_conv3/Conv2D/ReadVariableOp", "StatefulPartitionedCall/vgg16/block3_conv3/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "num_args": {"i": "1"}, "data_format": {"s": "TkhXQw=="}, "explicit_paddings": {"list": {}}, "epsilon": {"f": 0.0}, "use_cudnn_on_gpu": {"b": true}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "padding": {"s": "U0FNRQ=="}}}, {"name": "StatefulPartitionedCall/vgg16/block3_pool/MaxPool", "op": "MaxPool", "input": ["StatefulPartitionedCall/vgg16/block3_conv3/Relu"], "attr": {"padding": {"s": "VkFMSUQ="}, "data_format": {"s": "TkhXQw=="}, "explicit_paddings": {"list": {}}, "T": {"type": "DT_FLOAT"}, "ksize": {"list": {"i": ["1", "2", "2", "1"]}}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}}}, {"name": "StatefulPartitionedCall/vgg16/block4_conv1/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/vgg16/block3_pool/MaxPool", "StatefulPartitionedCall/vgg16/block4_conv1/Conv2D/ReadVariableOp", "StatefulPartitionedCall/vgg16/block4_conv1/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"padding": {"s": "U0FNRQ=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "explicit_paddings": {"list": {}}, "data_format": {"s": "TkhXQw=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/vgg16/block4_conv2/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/vgg16/block4_conv1/Relu", "StatefulPartitionedCall/vgg16/block4_conv2/Conv2D/ReadVariableOp", "StatefulPartitionedCall/vgg16/block4_conv2/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"num_args": {"i": "1"}, "data_format": {"s": "TkhXQw=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "padding": {"s": "U0FNRQ=="}, "use_cudnn_on_gpu": {"b": true}, "epsilon": {"f": 0.0}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/vgg16/block4_conv3/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/vgg16/block4_conv2/Relu", "StatefulPartitionedCall/vgg16/block4_conv3/Conv2D/ReadVariableOp", "StatefulPartitionedCall/vgg16/block4_conv3/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"epsilon": {"f": 0.0}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "data_format": {"s": "TkhXQw=="}, "padding": {"s": "U0FNRQ=="}, "num_args": {"i": "1"}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "T": {"type": "DT_FLOAT"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}}}, {"name": "StatefulPartitionedCall/vgg16/block4_pool/MaxPool", "op": "MaxPool", "input": ["StatefulPartitionedCall/vgg16/block4_conv3/Relu"], "attr": {"ksize": {"list": {"i": ["1", "2", "2", "1"]}}, "explicit_paddings": {"list": {}}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "padding": {"s": "VkFMSUQ="}}}, {"name": "StatefulPartitionedCall/vgg16/block5_conv1/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/vgg16/block4_pool/MaxPool", "StatefulPartitionedCall/vgg16/block5_conv1/Conv2D/ReadVariableOp", "StatefulPartitionedCall/vgg16/block5_conv1/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"strides": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "num_args": {"i": "1"}, "padding": {"s": "U0FNRQ=="}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "T": {"type": "DT_FLOAT"}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "epsilon": {"f": 0.0}}}, {"name": "StatefulPartitionedCall/vgg16/block5_conv2/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/vgg16/block5_conv1/Relu", "StatefulPartitionedCall/vgg16/block5_conv2/Conv2D/ReadVariableOp", "StatefulPartitionedCall/vgg16/block5_conv2/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"epsilon": {"f": 0.0}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "num_args": {"i": "1"}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "padding": {"s": "U0FNRQ=="}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}}}, {"name": "StatefulPartitionedCall/vgg16/block5_conv3/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/vgg16/block5_conv2/Relu", "StatefulPartitionedCall/vgg16/block5_conv3/Conv2D/ReadVariableOp", "StatefulPartitionedCall/vgg16/block5_conv3/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"use_cudnn_on_gpu": {"b": true}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "num_args": {"i": "1"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}}}, {"name": "StatefulPartitionedCall/vgg16/block5_pool/MaxPool", "op": "MaxPool", "input": ["StatefulPartitionedCall/vgg16/block5_conv3/Relu"], "attr": {"data_format": {"s": "TkhXQw=="}, "explicit_paddings": {"list": {}}, "ksize": {"list": {"i": ["1", "2", "2", "1"]}}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "T": {"type": "DT_FLOAT"}, "padding": {"s": "VkFMSUQ="}}}, {"name": "StatefulPartitionedCall/vgg16/flatten/Reshape", "op": "Reshape", "input": ["StatefulPartitionedCall/vgg16/block5_pool/MaxPool", "StatefulPartitionedCall/vgg16/flatten/Const"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/vgg16/fc1/Relu", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/vgg16/flatten/Reshape", "StatefulPartitionedCall/vgg16/fc1/MatMul/ReadVariableOp", "StatefulPartitionedCall/vgg16/fc1/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"num_args": {"i": "1"}, "transpose_b": {"b": false}, "transpose_a": {"b": false}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}}}, {"name": "StatefulPartitionedCall/vgg16/fc2/Relu", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/vgg16/fc1/Relu", "StatefulPartitionedCall/vgg16/fc2/MatMul/ReadVariableOp", "StatefulPartitionedCall/vgg16/fc2/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}, "transpose_a": {"b": false}, "num_args": {"i": "1"}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "epsilon": {"f": 0.0}}}, {"name": "StatefulPartitionedCall/vgg16/predictions/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/vgg16/fc2/Relu", "StatefulPartitionedCall/vgg16/predictions/MatMul/ReadVariableOp", "StatefulPartitionedCall/vgg16/predictions/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_b": {"b": false}, "transpose_a": {"b": false}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "num_args": {"i": "1"}}}, {"name": "StatefulPartitionedCall/vgg16/predictions/Softmax", "op": "Softmax", "input": ["StatefulPartitionedCall/vgg16/predictions/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Identity", "op": "Identity", "input": ["StatefulPartitionedCall/vgg16/predictions/Softmax"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {"producer": 987}}, "weightsManifest": [{"paths": ["group1-shard1of132.bin", "group1-shard2of132.bin", "group1-shard3of132.bin", "group1-shard4of132.bin", "group1-shard5of132.bin", "group1-shard6of132.bin", "group1-shard7of132.bin", "group1-shard8of132.bin", "group1-shard9of132.bin", "group1-shard10of132.bin", "group1-shard11of132.bin", "group1-shard12of132.bin", "group1-shard13of132.bin", "group1-shard14of132.bin", "group1-shard15of132.bin", "group1-shard16of132.bin", "group1-shard17of132.bin", "group1-shard18of132.bin", "group1-shard19of132.bin", "group1-shard20of132.bin", "group1-shard21of132.bin", "group1-shard22of132.bin", "group1-shard23of132.bin", "group1-shard24of132.bin", "group1-shard25of132.bin", "group1-shard26of132.bin", "group1-shard27of132.bin", "group1-shard28of132.bin", "group1-shard29of132.bin", "group1-shard30of132.bin", "group1-shard31of132.bin", "group1-shard32of132.bin", "group1-shard33of132.bin", "group1-shard34of132.bin", "group1-shard35of132.bin", "group1-shard36of132.bin", "group1-shard37of132.bin", "group1-shard38of132.bin", "group1-shard39of132.bin", "group1-shard40of132.bin", "group1-shard41of132.bin", "group1-shard42of132.bin", "group1-shard43of132.bin", "group1-shard44of132.bin", "group1-shard45of132.bin", "group1-shard46of132.bin", "group1-shard47of132.bin", "group1-shard48of132.bin", "group1-shard49of132.bin", "group1-shard50of132.bin", "group1-shard51of132.bin", "group1-shard52of132.bin", "group1-shard53of132.bin", "group1-shard54of132.bin", "group1-shard55of132.bin", "group1-shard56of132.bin", "group1-shard57of132.bin", "group1-shard58of132.bin", "group1-shard59of132.bin", "group1-shard60of132.bin", "group1-shard61of132.bin", "group1-shard62of132.bin", "group1-shard63of132.bin", "group1-shard64of132.bin", "group1-shard65of132.bin", "group1-shard66of132.bin", "group1-shard67of132.bin", "group1-shard68of132.bin", "group1-shard69of132.bin", "group1-shard70of132.bin", "group1-shard71of132.bin", "group1-shard72of132.bin", "group1-shard73of132.bin", "group1-shard74of132.bin", "group1-shard75of132.bin", "group1-shard76of132.bin", "group1-shard77of132.bin", "group1-shard78of132.bin", "group1-shard79of132.bin", "group1-shard80of132.bin", "group1-shard81of132.bin", "group1-shard82of132.bin", "group1-shard83of132.bin", "group1-shard84of132.bin", "group1-shard85of132.bin", "group1-shard86of132.bin", "group1-shard87of132.bin", "group1-shard88of132.bin", "group1-shard89of132.bin", "group1-shard90of132.bin", "group1-shard91of132.bin", "group1-shard92of132.bin", "group1-shard93of132.bin", "group1-shard94of132.bin", "group1-shard95of132.bin", "group1-shard96of132.bin", "group1-shard97of132.bin", "group1-shard98of132.bin", "group1-shard99of132.bin", "group1-shard100of132.bin", "group1-shard101of132.bin", "group1-shard102of132.bin", "group1-shard103of132.bin", "group1-shard104of132.bin", "group1-shard105of132.bin", "group1-shard106of132.bin", "group1-shard107of132.bin", "group1-shard108of132.bin", "group1-shard109of132.bin", "group1-shard110of132.bin", "group1-shard111of132.bin", "group1-shard112of132.bin", "group1-shard113of132.bin", "group1-shard114of132.bin", "group1-shard115of132.bin", "group1-shard116of132.bin", "group1-shard117of132.bin", "group1-shard118of132.bin", "group1-shard119of132.bin", "group1-shard120of132.bin", "group1-shard121of132.bin", "group1-shard122of132.bin", "group1-shard123of132.bin", "group1-shard124of132.bin", "group1-shard125of132.bin", "group1-shard126of132.bin", "group1-shard127of132.bin", "group1-shard128of132.bin", "group1-shard129of132.bin", "group1-shard130of132.bin", "group1-shard131of132.bin", "group1-shard132of132.bin"], "weights": [{"name": "StatefulPartitionedCall/vgg16/block1_conv1/Conv2D/ReadVariableOp", "shape": [3, 3, 3, 64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/vgg16/block1_conv1/BiasAdd/ReadVariableOp", "shape": [64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/vgg16/block1_conv2/Conv2D/ReadVariableOp", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/vgg16/block1_conv2/BiasAdd/ReadVariableOp", "shape": [64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/vgg16/block2_conv1/Conv2D/ReadVariableOp", "shape": [3, 3, 64, 128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/vgg16/block2_conv1/BiasAdd/ReadVariableOp", "shape": [128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/vgg16/block2_conv2/Conv2D/ReadVariableOp", "shape": [3, 3, 128, 128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/vgg16/block2_conv2/BiasAdd/ReadVariableOp", "shape": [128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/vgg16/block3_conv1/Conv2D/ReadVariableOp", "shape": [3, 3, 128, 256], "dtype": "float32"}, {"name": "StatefulPartitionedCall/vgg16/block3_conv1/BiasAdd/ReadVariableOp", "shape": [256], "dtype": "float32"}, {"name": "StatefulPartitionedCall/vgg16/block3_conv2/Conv2D/ReadVariableOp", "shape": [3, 3, 256, 256], "dtype": "float32"}, {"name": "StatefulPartitionedCall/vgg16/block3_conv2/BiasAdd/ReadVariableOp", "shape": [256], "dtype": "float32"}, {"name": "StatefulPartitionedCall/vgg16/block3_conv3/Conv2D/ReadVariableOp", "shape": [3, 3, 256, 256], "dtype": "float32"}, {"name": "StatefulPartitionedCall/vgg16/block3_conv3/BiasAdd/ReadVariableOp", "shape": [256], "dtype": "float32"}, {"name": "StatefulPartitionedCall/vgg16/block4_conv1/Conv2D/ReadVariableOp", "shape": [3, 3, 256, 512], "dtype": "float32"}, {"name": "StatefulPartitionedCall/vgg16/block4_conv1/BiasAdd/ReadVariableOp", "shape": [512], "dtype": "float32"}, {"name": "StatefulPartitionedCall/vgg16/block4_conv2/Conv2D/ReadVariableOp", "shape": [3, 3, 512, 512], "dtype": "float32"}, {"name": "StatefulPartitionedCall/vgg16/block4_conv2/BiasAdd/ReadVariableOp", "shape": [512], "dtype": "float32"}, {"name": "StatefulPartitionedCall/vgg16/block4_conv3/Conv2D/ReadVariableOp", "shape": [3, 3, 512, 512], "dtype": "float32"}, {"name": "StatefulPartitionedCall/vgg16/block4_conv3/BiasAdd/ReadVariableOp", "shape": [512], "dtype": "float32"}, {"name": "StatefulPartitionedCall/vgg16/block5_conv1/Conv2D/ReadVariableOp", "shape": [3, 3, 512, 512], "dtype": "float32"}, {"name": "StatefulPartitionedCall/vgg16/block5_conv1/BiasAdd/ReadVariableOp", "shape": [512], "dtype": "float32"}, {"name": "StatefulPartitionedCall/vgg16/block5_conv2/Conv2D/ReadVariableOp", "shape": [3, 3, 512, 512], "dtype": "float32"}, {"name": "StatefulPartitionedCall/vgg16/block5_conv2/BiasAdd/ReadVariableOp", "shape": [512], "dtype": "float32"}, {"name": "StatefulPartitionedCall/vgg16/block5_conv3/Conv2D/ReadVariableOp", "shape": [3, 3, 512, 512], "dtype": "float32"}, {"name": "StatefulPartitionedCall/vgg16/block5_conv3/BiasAdd/ReadVariableOp", "shape": [512], "dtype": "float32"}, {"name": "StatefulPartitionedCall/vgg16/flatten/Const", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/vgg16/fc1/MatMul/ReadVariableOp", "shape": [25088, 4096], "dtype": "float32"}, {"name": "StatefulPartitionedCall/vgg16/fc1/BiasAdd/ReadVariableOp", "shape": [4096], "dtype": "float32"}, {"name": "StatefulPartitionedCall/vgg16/fc2/MatMul/ReadVariableOp", "shape": [4096, 4096], "dtype": "float32"}, {"name": "StatefulPartitionedCall/vgg16/fc2/BiasAdd/ReadVariableOp", "shape": [4096], "dtype": "float32"}, {"name": "StatefulPartitionedCall/vgg16/predictions/MatMul/ReadVariableOp", "shape": [4096, 1000], "dtype": "float32"}, {"name": "StatefulPartitionedCall/vgg16/predictions/BiasAdd/ReadVariableOp", "shape": [1000], "dtype": "float32"}]}]}