{"format": "graph-model", "generatedBy": "2.8.0", "convertedBy": "TensorFlow.js Converter v3.15.0", "signature": {"inputs": {"input_4": {"name": "input_4:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "32"}, {"size": "32"}, {"size": "3"}]}}}, "outputs": {"dense_1": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "10"}]}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/model_1/block1_conv1/Conv2D/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "3"}, {"size": "64"}]}}}}}, {"name": "StatefulPartitionedCall/model_1/block1_conv1/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/block1_conv2/Conv2D/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "64"}]}}}}}, {"name": "StatefulPartitionedCall/model_1/block1_conv2/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}}}, {"name": "StatefulPartitionedCall/model_1/block2_conv1/Conv2D/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/model_1/block2_conv1/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/block2_conv2/Conv2D/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/block2_conv2/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/block3_conv1/Conv2D/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/block3_conv1/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/block3_conv2/Conv2D/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "256"}, {"size": "256"}]}}}}}, {"name": "StatefulPartitionedCall/model_1/block3_conv2/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/block3_conv3/Conv2D/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "256"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/block3_conv3/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/block4_conv1/Conv2D/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "256"}, {"size": "512"}]}}}}}, {"name": "StatefulPartitionedCall/model_1/block4_conv1/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/block4_conv2/Conv2D/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "512"}, {"size": "512"}]}}}}}, {"name": "StatefulPartitionedCall/model_1/block4_conv2/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}}}, {"name": "StatefulPartitionedCall/model_1/block4_conv3/Conv2D/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "512"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/block4_conv3/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/block5_conv1/Conv2D/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "512"}, {"size": "512"}]}}}}}, {"name": "StatefulPartitionedCall/model_1/block5_conv1/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}}}, {"name": "StatefulPartitionedCall/model_1/block5_conv2/Conv2D/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "512"}, {"size": "512"}]}}}}}, {"name": "StatefulPartitionedCall/model_1/block5_conv2/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/block5_conv3/Conv2D/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "512"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/block5_conv3/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/global_max_pooling2d_2/Max/reduction_indices", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/model_1/dense_1/MatMul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}, {"size": "10"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/dense_1/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "10"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "input_4", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {"dim": [{"size": "-1"}, {"size": "32"}, {"size": "32"}, {"size": "3"}]}}}}, {"name": "StatefulPartitionedCall/model_1/block1_conv1/Relu", "op": "_FusedConv2D", "input": ["input_4", "StatefulPartitionedCall/model_1/block1_conv1/Conv2D/ReadVariableOp", "StatefulPartitionedCall/model_1/block1_conv1/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "num_args": {"i": "1"}, "explicit_paddings": {"list": {}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "padding": {"s": "U0FNRQ=="}, "epsilon": {"f": 0.0}}}, {"name": "StatefulPartitionedCall/model_1/block1_conv2/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/model_1/block1_conv1/Relu", "StatefulPartitionedCall/model_1/block1_conv2/Conv2D/ReadVariableOp", "StatefulPartitionedCall/model_1/block1_conv2/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"explicit_paddings": {"list": {}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "padding": {"s": "U0FNRQ=="}, "num_args": {"i": "1"}, "use_cudnn_on_gpu": {"b": true}, "T": {"type": "DT_FLOAT"}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "epsilon": {"f": 0.0}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}}}, {"name": "StatefulPartitionedCall/model_1/block1_pool/MaxPool", "op": "MaxPool", "input": ["StatefulPartitionedCall/model_1/block1_conv2/Relu"], "attr": {"data_format": {"s": "TkhXQw=="}, "padding": {"s": "VkFMSUQ="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "T": {"type": "DT_FLOAT"}, "ksize": {"list": {"i": ["1", "2", "2", "1"]}}, "explicit_paddings": {"list": {}}}}, {"name": "StatefulPartitionedCall/model_1/block2_conv1/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/model_1/block1_pool/MaxPool", "StatefulPartitionedCall/model_1/block2_conv1/Conv2D/ReadVariableOp", "StatefulPartitionedCall/model_1/block2_conv1/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"strides": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "padding": {"s": "U0FNRQ=="}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "epsilon": {"f": 0.0}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "use_cudnn_on_gpu": {"b": true}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "num_args": {"i": "1"}}}, {"name": "StatefulPartitionedCall/model_1/block2_conv2/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/model_1/block2_conv1/Relu", "StatefulPartitionedCall/model_1/block2_conv2/Conv2D/ReadVariableOp", "StatefulPartitionedCall/model_1/block2_conv2/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"use_cudnn_on_gpu": {"b": true}, "T": {"type": "DT_FLOAT"}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "epsilon": {"f": 0.0}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "padding": {"s": "U0FNRQ=="}, "num_args": {"i": "1"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/model_1/block2_pool/MaxPool", "op": "MaxPool", "input": ["StatefulPartitionedCall/model_1/block2_conv2/Relu"], "attr": {"padding": {"s": "VkFMSUQ="}, "explicit_paddings": {"list": {}}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "ksize": {"list": {"i": ["1", "2", "2", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}}}, {"name": "StatefulPartitionedCall/model_1/block3_conv1/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/model_1/block2_pool/MaxPool", "StatefulPartitionedCall/model_1/block3_conv1/Conv2D/ReadVariableOp", "StatefulPartitionedCall/model_1/block3_conv1/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}, "use_cudnn_on_gpu": {"b": true}, "num_args": {"i": "1"}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "padding": {"s": "U0FNRQ=="}, "epsilon": {"f": 0.0}, "explicit_paddings": {"list": {}}, "data_format": {"s": "TkhXQw=="}}}, {"name": "StatefulPartitionedCall/model_1/block3_conv2/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/model_1/block3_conv1/Relu", "StatefulPartitionedCall/model_1/block3_conv2/Conv2D/ReadVariableOp", "StatefulPartitionedCall/model_1/block3_conv2/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "data_format": {"s": "TkhXQw=="}, "epsilon": {"f": 0.0}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "num_args": {"i": "1"}, "explicit_paddings": {"list": {}}}}, {"name": "StatefulPartitionedCall/model_1/block3_conv3/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/model_1/block3_conv2/Relu", "StatefulPartitionedCall/model_1/block3_conv3/Conv2D/ReadVariableOp", "StatefulPartitionedCall/model_1/block3_conv3/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "use_cudnn_on_gpu": {"b": true}, "num_args": {"i": "1"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/model_1/block3_pool/MaxPool", "op": "MaxPool", "input": ["StatefulPartitionedCall/model_1/block3_conv3/Relu"], "attr": {"data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}, "ksize": {"list": {"i": ["1", "2", "2", "1"]}}, "explicit_paddings": {"list": {}}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "padding": {"s": "VkFMSUQ="}}}, {"name": "StatefulPartitionedCall/model_1/block4_conv1/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/model_1/block3_pool/MaxPool", "StatefulPartitionedCall/model_1/block4_conv1/Conv2D/ReadVariableOp", "StatefulPartitionedCall/model_1/block4_conv1/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "explicit_paddings": {"list": {}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "num_args": {"i": "1"}, "padding": {"s": "U0FNRQ=="}, "epsilon": {"f": 0.0}}}, {"name": "StatefulPartitionedCall/model_1/block4_conv2/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/model_1/block4_conv1/Relu", "StatefulPartitionedCall/model_1/block4_conv2/Conv2D/ReadVariableOp", "StatefulPartitionedCall/model_1/block4_conv2/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}, "padding": {"s": "U0FNRQ=="}, "explicit_paddings": {"list": {}}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "epsilon": {"f": 0.0}, "num_args": {"i": "1"}, "use_cudnn_on_gpu": {"b": true}}}, {"name": "StatefulPartitionedCall/model_1/block4_conv3/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/model_1/block4_conv2/Relu", "StatefulPartitionedCall/model_1/block4_conv3/Conv2D/ReadVariableOp", "StatefulPartitionedCall/model_1/block4_conv3/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "padding": {"s": "U0FNRQ=="}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "num_args": {"i": "1"}, "data_format": {"s": "TkhXQw=="}, "explicit_paddings": {"list": {}}}}, {"name": "StatefulPartitionedCall/model_1/block4_pool/MaxPool", "op": "MaxPool", "input": ["StatefulPartitionedCall/model_1/block4_conv3/Relu"], "attr": {"ksize": {"list": {"i": ["1", "2", "2", "1"]}}, "padding": {"s": "VkFMSUQ="}, "explicit_paddings": {"list": {}}, "data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}}}, {"name": "StatefulPartitionedCall/model_1/block5_conv1/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/model_1/block4_pool/MaxPool", "StatefulPartitionedCall/model_1/block5_conv1/Conv2D/ReadVariableOp", "StatefulPartitionedCall/model_1/block5_conv1/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"explicit_paddings": {"list": {}}, "padding": {"s": "U0FNRQ=="}, "use_cudnn_on_gpu": {"b": true}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "data_format": {"s": "TkhXQw=="}, "epsilon": {"f": 0.0}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "num_args": {"i": "1"}}}, {"name": "StatefulPartitionedCall/model_1/block5_conv2/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/model_1/block5_conv1/Relu", "StatefulPartitionedCall/model_1/block5_conv2/Conv2D/ReadVariableOp", "StatefulPartitionedCall/model_1/block5_conv2/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "data_format": {"s": "TkhXQw=="}, "padding": {"s": "U0FNRQ=="}, "T": {"type": "DT_FLOAT"}, "epsilon": {"f": 0.0}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "num_args": {"i": "1"}}}, {"name": "StatefulPartitionedCall/model_1/block5_conv3/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/model_1/block5_conv2/Relu", "StatefulPartitionedCall/model_1/block5_conv3/Conv2D/ReadVariableOp", "StatefulPartitionedCall/model_1/block5_conv3/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"padding": {"s": "U0FNRQ=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "num_args": {"i": "1"}, "explicit_paddings": {"list": {}}, "epsilon": {"f": 0.0}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "use_cudnn_on_gpu": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/block5_pool/MaxPool", "op": "MaxPool", "input": ["StatefulPartitionedCall/model_1/block5_conv3/Relu"], "attr": {"padding": {"s": "VkFMSUQ="}, "ksize": {"list": {"i": ["1", "2", "2", "1"]}}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}}}, {"name": "StatefulPartitionedCall/model_1/global_max_pooling2d_2/Max", "op": "Max", "input": ["StatefulPartitionedCall/model_1/block5_pool/MaxPool", "StatefulPartitionedCall/model_1/global_max_pooling2d_2/Max/reduction_indices"], "attr": {"T": {"type": "DT_FLOAT"}, "Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": false}}}, {"name": "StatefulPartitionedCall/model_1/dense_1/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/model_1/global_max_pooling2d_2/Max", "StatefulPartitionedCall/model_1/dense_1/MatMul/ReadVariableOp", "StatefulPartitionedCall/model_1/dense_1/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}, "num_args": {"i": "1"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "transpose_b": {"b": false}, "transpose_a": {"b": false}, "epsilon": {"f": 0.0}}}, {"name": "StatefulPartitionedCall/model_1/dense_1/Softmax", "op": "Softmax", "input": ["StatefulPartitionedCall/model_1/dense_1/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Identity", "op": "Identity", "input": ["StatefulPartitionedCall/model_1/dense_1/Softmax"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {"producer": 987}}, "weightsManifest": [{"paths": ["group1-shard1of15.bin", "group1-shard2of15.bin", "group1-shard3of15.bin", "group1-shard4of15.bin", "group1-shard5of15.bin", "group1-shard6of15.bin", "group1-shard7of15.bin", "group1-shard8of15.bin", "group1-shard9of15.bin", "group1-shard10of15.bin", "group1-shard11of15.bin", "group1-shard12of15.bin", "group1-shard13of15.bin", "group1-shard14of15.bin", "group1-shard15of15.bin"], "weights": [{"name": "StatefulPartitionedCall/model_1/block1_conv1/Conv2D/ReadVariableOp", "shape": [3, 3, 3, 64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model_1/block1_conv1/BiasAdd/ReadVariableOp", "shape": [64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model_1/block1_conv2/Conv2D/ReadVariableOp", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model_1/block1_conv2/BiasAdd/ReadVariableOp", "shape": [64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model_1/block2_conv1/Conv2D/ReadVariableOp", "shape": [3, 3, 64, 128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model_1/block2_conv1/BiasAdd/ReadVariableOp", "shape": [128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model_1/block2_conv2/Conv2D/ReadVariableOp", "shape": [3, 3, 128, 128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model_1/block2_conv2/BiasAdd/ReadVariableOp", "shape": [128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model_1/block3_conv1/Conv2D/ReadVariableOp", "shape": [3, 3, 128, 256], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model_1/block3_conv1/BiasAdd/ReadVariableOp", "shape": [256], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model_1/block3_conv2/Conv2D/ReadVariableOp", "shape": [3, 3, 256, 256], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model_1/block3_conv2/BiasAdd/ReadVariableOp", "shape": [256], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model_1/block3_conv3/Conv2D/ReadVariableOp", "shape": [3, 3, 256, 256], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model_1/block3_conv3/BiasAdd/ReadVariableOp", "shape": [256], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model_1/block4_conv1/Conv2D/ReadVariableOp", "shape": [3, 3, 256, 512], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model_1/block4_conv1/BiasAdd/ReadVariableOp", "shape": [512], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model_1/block4_conv2/Conv2D/ReadVariableOp", "shape": [3, 3, 512, 512], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model_1/block4_conv2/BiasAdd/ReadVariableOp", "shape": [512], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model_1/block4_conv3/Conv2D/ReadVariableOp", "shape": [3, 3, 512, 512], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model_1/block4_conv3/BiasAdd/ReadVariableOp", "shape": [512], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model_1/block5_conv1/Conv2D/ReadVariableOp", "shape": [3, 3, 512, 512], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model_1/block5_conv1/BiasAdd/ReadVariableOp", "shape": [512], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model_1/block5_conv2/Conv2D/ReadVariableOp", "shape": [3, 3, 512, 512], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model_1/block5_conv2/BiasAdd/ReadVariableOp", "shape": [512], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model_1/block5_conv3/Conv2D/ReadVariableOp", "shape": [3, 3, 512, 512], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model_1/block5_conv3/BiasAdd/ReadVariableOp", "shape": [512], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model_1/global_max_pooling2d_2/Max/reduction_indices", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model_1/dense_1/MatMul/ReadVariableOp", "shape": [512, 10], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model_1/dense_1/BiasAdd/ReadVariableOp", "shape": [10], "dtype": "float32"}]}]}